Revit 2020 API
ImageTypeOptions Properties
The ImageTypeOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PageNumber
 The page in the file to be used for the image
Path
 The path of the file that specifies the image to be used.
Resolution
 The Resolution of the image is expressed in dots-per-inch and hence determines the size of a pixel in the image.
See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace